TheShopAtVSP/Level-HRM/nrf51 uart code/nrf51 uart code/components/drivers_nrf/pstorage/config/pstorage_platform.h
/* Copyright (c)  2013 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

 /** @cond To make doxygen skip this file */

/** @file
 *  This header contains defines with respect persistent storage that are specific to
 *  persistent storage implementation and application use case.
 */
#ifndef PSTORAGE_PL_H__
#define PSTORAGE_PL_H__

#include <stdint.h>
#include "nrf.h"

static __INLINE uint16_t pstorage_flash_page_size()
{
  return (uint16_t)NRF_FICR->CODEPAGESIZE;
}
#define FLASH_PAGE_SIZE				(0x1000)							//size of 1 memory page: 4KB (known at compile time)
#define PSTORAGE_FLASH_PAGE_SIZE     FLASH_PAGE_SIZE					//pstorage_flash_page_size()          /**< Size of one flash page (Not known at compile time) */
#define PSTORAGE_FLASH_EMPTY_MASK    0xFFFFFFFF                          /**< Bit mask that defines an empty address in flash. */

#ifdef NRF51
#define BOOTLOADER_ADDRESS           (NRF_UICR->BOOTLOADERADDR)
#elif defined NRF52
#define BOOTLOADER_ADDRESS           (PSTORAGE_FLASH_EMPTY_MASK)
#endif

static __INLINE uint32_t pstorage_flash_page_end()
{
   uint32_t bootloader_addr = BOOTLOADER_ADDRESS;
  
   return ((bootloader_addr != PSTORAGE_FLASH_EMPTY_MASK) ?
           (bootloader_addr/ PSTORAGE_FLASH_PAGE_SIZE) : NRF_FICR->CODESIZE);
}

//Device Manager: 1 Page, Data Log: 64 pages, Config: 1 page, Swap Area: 1 page
#define NUM_DM_PAGES				1		//First Page Registered to Device Manager
#define NUM_LOG_PAGES				64		//Next Pages Registered for Data Logging
#define NUM_CONFIG_PAGES			1		//Last User Page to store persistent configurations
#define NUM_SWAP_PAGES				1		//The Swap Page that PSTORE requires (Do Not include in PSTORAGE_NUM_OF_PAGES) 
#define PSTORAGE_NUM_OF_PAGES       (NUM_DM_PAGES + NUM_LOG_PAGES + NUM_CONFIG_PAGES)	/**< Number of flash pages allocated for the pstorage module excluding the swap page, configurable based on system requirements. */
#define PSTORAGE_MIN_BLOCK_SIZE     0x0010												/**< Minimum size of block that can be registered with the module. Should be configured based on system requirements, recommendation is not have this value to be at least size of word. */

#define PSTORAGE_FLASH_PAGE_END 	0x78000		//pstorage_flash_page_end()				//Starting Address of the first Page that the bootloader occupies
#define PSTORAGE_SWAP_ADDR          ((uint32_t)PSTORAGE_FLASH_PAGE_END - NUM_SWAP_PAGES*FLASH_PAGE_SIZE)
#define PSTORAGE_CONFIG_ADDR		((uint32_t)PSTORAGE_SWAP_ADDR - NUM_CONFIG_PAGES*FLASH_PAGE_SIZE)
#define PSTORAGE_LOG_START_ADDR     ((uint32_t)PSTORAGE_CONFIG_ADDR - NUM_LOG_PAGES*FLASH_PAGE_SIZE)
#define PSTORAGE_DM_START_ADDR		((uint32_t)PSTORAGE_LOG_START_ADDR - NUM_DM_PAGES*FLASH_PAGE_SIZE)
#define PSTORAGE_DATA_START_ADDR	PSTORAGE_DM_START_ADDR

#define PSTORAGE_MAX_BLOCK_SIZE     ((PSTORAGE_NUM_OF_PAGES-2)*FLASH_PAGE_SIZE)			/**< Maximum size of block that can be registered with the module. Should be configured based on system requirements. And should be greater than or equal to the minimum size. */
#define PSTORAGE_CMD_QUEUE_SIZE     10													/**< Maximum number of flash access commands that can be maintained by the module for all applications. Configurable. */


/** Abstracts persistently memory block identifier. */
typedef uint32_t pstorage_block_t;

typedef struct
{
    uint32_t            module_id;      /**< Module ID.*/
    pstorage_block_t    block_id;       /**< Block ID.*/
} pstorage_handle_t;

typedef uint32_t pstorage_size_t;      /** Size of length and offset fields. */

/**@brief Handles Flash Access Result Events. To be called in the system event dispatcher of the application. */
void pstorage_sys_event_handler (uint32_t sys_evt);

#endif // PSTORAGE_PL_H__

/** @} */
/** @endcond */
